#include <stdio.h>
void main(){
    int c, x=0;
    scanf("%d", &c);
    if(c<0) printf("None");
    else{
    char ka[10][c];
    //เคลียร์ค่า ให้เป็น -
    for(int i=0; i<10; i++){
        for(int j=0; j<c; j++){
            ka[i][j] = '-';
        }
    }
    for(int i=0; i<4; i++){
        //row จะมีค่าไม่เกิน 3
        //i = 0 row = 3 |i = 1 row = 2 | i = 2 row = 1 | i = 3 row = 0
        int row = 3 - i;
        for(int j=0; j<c; j++){
            // col จะมีค่า 0 - 4
            //0 % 5 = 0 | 1 % 5 = 1 | 2 % 5 = 2 | 3 % 5 = 3 | 4 % 5 = 4 | 5 % 5 = 0
            int col = j % 5;
    //row == col เพราะรอบแรกตอนที่ row เป็น 3 เส้น / จะโดนปริ้นใน col ที่ 3 แล้วก็จะไล่เข้ามาเรื่อย ๆ
            if(row == col){
                ka[i][j] = '/';
            //ดึงช่องข้างล่างมาวาด \\ ด้วย เริ่มที่แถวล่างสุด แล้วก็ไล่ตาม i มา กลายเป็นแถวที่ 9 - i ที่ i เพิ่มขึ้นในแต่ละรอบ
                ka[10 - 1 - i][j] = '\\';
            }
            // ทำเส้นขีดกั้น col == 4 ก่อนที่ col จะกลับไปเป็น 0 แล้วเริ่มทำพลังชุดใหม่
            else if(col == 4){
                ka[i][j] = '|';
                ka[10 - 1 -i][j] = '|';
            }

        }
    }
    for(int i=0; i<10; i++){
        for(int j=0; j<c; j++){
            printf("%c", ka[i][j]);
        }
        printf("\n");
        }
    }
}
